import '../models/overview_model.dart';

abstract class OverviewRemoteDataSource {
  Future<OverviewModel> getOverview();
}

class OverviewRemoteDataSourceImpl implements OverviewRemoteDataSource {
  @override
  Future<OverviewModel> getOverview() async {
    // Simulate API call
    await Future.delayed(const Duration(seconds: 1));
    return const OverviewModel(
      title: 'বাংলাদেশ ইসলামী মহিলা মজলিস',
      description: 'আল্লাহ রাব্বুল আলামীন হচ্ছেন এই বিশ্বজগতের সৃষ্টিকর্তা, পালনকর্তা ও বিধানদাতা। তিনি সমস্ত কিছুর নিয়ন্ত্রক ও পরিচালক।',
      aimsAndObjectives: [
        'এ সংগঠনের লক্ষ্য ও উদ্দেশ্য হচ্ছে বাংলাদেশের মহিলা সমাজকে কুরআন ও সুন্নাহর আলোকে সঠিক ইসলামী চেতনায় উদ্বুদ্ধ করে দ্বীন প্রতিষ্ঠার কাজে সক্রিয় করে তোলা, এর মাধ্যমে মানবতার মুক্তি, পরকালীন নাজাত ও সর্বোপরি আল্লাহর সন্তোষ অর্জন।'
      ],
      programs: [
        'দাওয়াত: বাংলাদেশের মহিলা সমাজের নিকট ইসলামের সঠিক দাওয়াত পৌঁছানো এবং এর আলোকে ব্যক্তি ও পারিবারিক জীবনকে পুনর্গঠনে উদ্বুদ্ধ করা।',
        'সংগঠন: যে সমস্ত মহিলা এ দাওয়াতে সাড়া দেবেন তাদেরকে সুসংগঠিত করা।',
        'প্রশিক্ষণ: সুসংগঠিত মহিলাদেরকে আদর্শ মুসলিম নারী ও দ্বীন প্রতিষ্ঠার যোগ্য কর্মী হিসেবে গড়ে তোলা।',
        'নারী সমাজের সমস্যা সমাধান: ইসলামী মূল্যবোধের আলোকে মহিলাদের বহুমুখী সমস্যা সমাধান ও অধিকার আদায়ে সাধ্যমত প্রচেষ্টা চালানো।',
        'ইসলামী আন্দোলনে ভূমিকা পালন: ইসলামী সমাজ তথা খেলাফত প্রতিষ্ঠার সংগ্রামে সহযোগী শক্তি হিসেবে সর্বাত্মক ভূমিকা পালন।'
      ],
      manpowerTiers: [
        'প্রাথমিক সদস্যা: যদি কোন মহিলা এ সংগঠনের লক্ষ্য ও উদ্দেশ্যের সাথে একমত পোষণ করে নির্দিষ্ট প্রাথমিক সদস্যা ফরম পূরণ করেন তবে তিনি এ সংগঠনের প্রাথমিক সদস্যা হিসেবে গণ্য হবেন।',
        'কর্মী: যে সমস্ত প্রাথমিক সদস্যা নিয়মিত তিনটি কাজ করেন তিনি এ সংগঠনের কর্মী হিসেবে গণ্য হবেন।',
        'সদস্যা: এই সংগঠনের যে কোন প্রাথমিক সদস্যা যদি এ সংগঠনের লক্ষ্য-উদ্দেশ্যকে নিজের জীবনের লক্ষ্য ও উদ্দেশ্য হিসেবে গ্রহণ করেন, তবে তিনি সদস্যা হতে পারেন।'
      ],
    );
  }
}
